#include "Menu.h"
#include <iostream>
using namespace std;
void ShowMainMenu() 
{
    system("cls");
    cout << "========================================\n";
    cout << "             ГОЛОВНЕ МЕНЮ              \n";
    cout << "========================================\n";
    cout << " 1. Теоретична частина                 \n";
    cout << " 2. Практичні задачі                    \n";
    cout << " 3. Тестування                          \n";
    cout << " 4. Імітація простих експериментів      \n";
    cout << " 0. Вихід                               \n";
    cout << "========================================\n";
    cout << "Ваш вибір: ";
}